--
-- Table structure for table `caipiao_caipiao`
--

DROP TABLE IF EXISTS `caipiao_caipiao`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `caipiao_caipiao` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `typeid` char(20) NOT NULL COMMENT 'Phân loại xổ số (ssc, k3)',
  `title` varchar(80) NOT NULL COMMENT 'Tên loại xổ số',
  `ftitle` varchar(180) NOT NULL COMMENT 'Giới thiệu loại xổ số',
  `firsttime` char(8) DEFAULT NULL,
  `endtime` char(8) DEFAULT NULL,
  `qishu` smallint(3) NOT NULL,
  `name` char(30) NOT NULL COMMENT 'Mã loại xổ số (duy nhất)',
  `ftime` smallint(6) NOT NULL DEFAULT '120' COMMENT 'Khoảng thời gian dừng cược',
  `isopen` tinyint(1) NOT NULL DEFAULT '1' COMMENT 'Có mở không',
  `is_hot` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'Có phổ biến không',
  `issys` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0-xổ số bên thứ ba 1-xổ số hệ thống',
  `closetime1` time NOT NULL DEFAULT '00:00:00',
  `closetime2` time NOT NULL DEFAULT '00:00:00',
  `expecttime` smallint(6) NOT NULL DEFAULT '1' COMMENT 'Bao lâu 1 kỳ, tối thiểu 1 phút',
  `iswh` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1-bảo trì',
  `allsort` smallint(6) NOT NULL,
  `listorder` smallint(6) NOT NULL,
  `isgf` tinyint(1) NOT NULL DEFAULT '0',
  `isct` tinyint(1) DEFAULT '0',
  `issd` int(1) DEFAULT '0',
  `hemai_status` tinyint(1) DEFAULT NULL,
  `hemai_danqi_sum` int(1) DEFAULT NULL,
  `hemai_baomi_type` tinyint(1) DEFAULT NULL,
  `hemai_touzhu_beishu` int(1) DEFAULT NULL,
  `hemai_touzhe_bili` int(1) DEFAULT NULL,
  `hemai_baodi_status` tinyint(1) DEFAULT NULL,
  `hemai_wanfa_type` varchar(700) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `typeid` (`typeid`)
) ENGINE=InnoDB AUTO_INCREMENT=156 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `caipiao_caipiao`
--

LOCK TABLES `caipiao_caipiao` WRITE;
/*!40000 ALTER TABLE `caipiao_caipiao` DISABLE KEYS */;
INSERT INTO `caipiao_caipiao` VALUES (17,'k3','Giang Tô快3','20xu钟1期','08:50:50','22:10:50',41,'jsk3',120,0,1,0,'00:00:00','00:00:00',3,1,1,2,0,1,0,1,5,0,30,30,0,'sthtx,slhtx,k3hzzx,'),(19,'k3','Quảng Tây快3','全ngày40期','09:37:30','22:27:30',40,'gxk3',120,0,0,0,'00:00:00','00:00:00',1,1,2,9,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(20,'k3','An Huy快3','全ngày40期','09:00:00','22:00:00',40,'ahk3',120,0,0,0,'00:00:00','00:00:00',1,1,3,11,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(53,'k3','Hà Bắc快3','全ngày41期','8:30:00','22:00:00',41,'hebk3',120,0,0,0,'00:00:00','00:00:00',1,1,4,5,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(92,'k3','1xu快3','1xu钟1期','00:00:00','23:30:00',1439,'f1k3',10,0,1,1,'00:00:00','23:59:00',1,1,5,10,0,1,1,1,5,0,30,30,0,'sthtx,slhtx,k3hzzx,'),(93,'k3','Cát Lâm快3','全ngày40期','08:40:50','22:00:50',41,'jlk3',180,0,0,1,'09:00:00','00:00:00',5,1,6,7,0,1,0,1,5,0,30,30,0,'sthtx,slhtx,k3hzzx,'),(97,'ssc','lớn发2xu彩','2xu钟1期','10:00:00','23:59:00',0,'dfssc',10,0,0,1,'01:00:00','23:00:00',2,1,7,4,0,0,1,1,5,0,30,30,1,'2x,dw,dxds,'),(98,'ssc','ngày津时时彩','全ngày84期','09:09:36','22:59:36',84,'tjssc',120,0,0,0,'00:00:00','00:00:00',1,1,8,3,0,0,0,1,5,0,30,30,1,'2x,dw,dxds,'),(99,'ssc','mới疆时时彩','全ngày96期','10:10:34','02:00:34',96,'xjssc',120,0,1,0,'00:00:00','00:00:00',1,1,9,2,0,0,0,1,5,0,30,30,1,'2x,dw,dxds,'),(100,'ssc','重庆时时彩','10xu钟1期','10:00:00','2:00:00',120,'cqssc',120,0,1,0,'00:00:00','00:00:00',1,1,10,1,0,1,1,1,5,0,30,30,1,'2x,dw,dxds,'),(102,'pk10','Bắc KinhPK10','全ngày44期','09:10:40','23:50:40',44,'bjpk10',70,0,1,0,'00:00:00','00:00:00',1,1,11,1,0,1,0,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(103,'keno','Bắc Kinh快乐8','全ngày179期','09:05:05','23:55:05',179,'bjkeno',60,0,0,0,'00:00:00','00:00:00',1,1,12,1,0,0,0,1,5,0,30,30,1,NULL),(104,'x5','广东11选5','全ngày84期','09:11:00','23:01:00',84,'gd11x5',120,0,1,0,'00:00:00','00:00:00',1,1,13,1,0,0,0,1,5,0,30,30,1,'bdw,dw,'),(105,'x5','Thượng Hải11选5','全ngày90期','08:59:00','23:49:00',90,'sh11x5',120,0,0,0,'00:00:00','00:00:00',1,1,14,2,0,0,0,1,5,0,30,30,1,'bdw,dw,'),(107,'x5','江西11选5','全ngày84期','09:10:00','23:00:0',84,'jx11x5',120,0,0,0,'00:00:00','00:00:00',1,1,15,4,0,0,0,1,5,0,30,30,1,'bdw,dw,'),(114,'pk10','台湾PK10','2xu钟1期','00:00:00','',0,'dfpk10',10,0,0,1,'10:30:00','22:30:00',2,1,16,114,0,0,0,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(116,'lhc','香港六合彩','Hàng tuần三期','00:00:00',NULL,0,'lhc',1800,0,0,0,'00:00:00','00:00:00',1,1,17,115,0,0,0,1,5,0,30,30,1,'tmzx,tmlm,sxtx,'),(117,'lhc','lớn发六合彩','2xu钟1期','00:00:00',NULL,0,'dflhc',30,0,1,1,'00:01:00','23:30:00',2,1,18,117,0,0,1,1,5,0,30,30,1,'tmzx,tmlm,sxtx,'),(118,'k3','Thượng Hải快3','全ngày41期','00:00:00',NULL,41,'shk3',120,0,0,0,'00:00:00','00:00:00',1,1,19,118,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(119,'k3','甘肃快3','全ngày36期','00:00:00',NULL,36,'gsk3',120,0,0,0,'00:00:00','00:00:00',1,0,19,119,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(120,'k3','贵州快3','全ngày39期','09:30:00',NULL,39,'guizhouk3',120,0,0,0,'09:30:00','00:00:00',1,0,20,120,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(121,'k3','Hồ Bắc快3','全ngày39期','00:00:00',NULL,39,'hubk3',120,0,0,0,'00:00:00','00:00:00',1,0,21,121,0,1,0,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(122,'k3','3xu快3','全ngày480期','00:00:00','',480,'f3k3',10,0,1,1,'00:00:00','23:59:00',3,0,22,122,0,1,1,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(123,'k3','5xu快3','全ngày288期','00:00:00',NULL,288,'f5k3',10,0,1,1,'00:00:00','23:59:00',5,0,23,123,0,1,1,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(124,'ssc','lớn发xuxu彩','一xu钟一期','00:00:00','23:59:00',1439,'ssc1fc',10,0,0,1,'00:00:00','23:59:00',1,0,24,124,0,1,1,1,5,0,30,30,1,'2x,dw,dxds,longhu'),(125,'ssc','5xu彩','全ngày288期','00:00:00','23:55:00',288,'ssc5fc',10,0,0,1,'00:00:00','00:00:00',5,0,25,125,0,0,1,1,5,0,30,30,1,'2x,dw,dxds,'),(126,'ssc','3xu彩','全ngày480期','00:00:00','23:55:00',480,'ssc3fc',10,0,0,1,'00:00:00','00:00:00',3,0,26,126,0,0,1,1,5,0,30,30,1,'2x,dw,dxds,'),(127,'ssc','台湾5xu彩','全ngày204期','00:00:00','23:55:00',204,'ssctw5fc',10,0,0,1,'00:00:00','23:55:00',5,0,27,127,0,0,0,1,5,0,30,30,1,'2x,dw,dxds,'),(128,'lhc','10xu六合','全ngày144期','00:00:00','23:55:00',144,'lhc10f',120,0,0,1,'00:00:00','23:59:00',10,0,28,128,0,0,1,1,5,0,30,30,1,'tmzx,tmlm,sxtx,'),(129,'lhc','1xu六合','一xu钟一期','00:00:00','23:55:00',1439,'lhc1f',10,0,0,1,'00:00:00','23:59:00',1,0,29,129,0,0,1,1,5,0,30,30,1,'tmzx,tmlm,sxtx,'),(130,'lhc','5xu六合','5xu钟一期','00:00:00','23:55:00',288,'lhc5f',10,0,0,1,'00:00:00','23:59:00',5,0,30,130,0,0,1,1,5,0,30,30,1,'tmzx,tmlm,sxtx,'),(131,'pk10','1xu赛车','1xu钟一期','00:00:00',NULL,1439,'pk101',10,0,0,1,'00:00:00','23:59:00',1,0,31,131,0,1,1,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(132,'pk10','5xu赛车','全ngày288期','00:00:00',NULL,288,'pk105',10,0,0,1,'00:00:00','23:59:00',5,0,32,132,0,1,1,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(133,'pk10','3xu赛车','全ngày480期','00:00:00',NULL,480,'pk103',10,0,0,1,'00:00:00','23:59:00',3,0,33,133,0,1,1,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(134,'x5','Giang Tô11选5','全ngày84期','00:00:00',NULL,0,'js11x5',120,0,0,0,'00:00:00','23:55:00',1,0,34,134,0,0,0,1,5,0,30,30,1,'bdw,dw,'),(135,'x5','山东11选5','全ngày87期','00:00:00',NULL,0,'sd11x5',10,0,0,0,'00:00:00','23:55:00',20,0,35,135,0,0,0,1,5,0,30,30,1,'bdw,dw,'),(136,'x5','1xu11选5','1xu钟1期','00:00:00',NULL,1439,'yf11x5',10,0,0,1,'00:00:00','23:59:00',1,0,36,136,0,0,1,1,5,0,30,30,1,'bdw,dw,'),(137,'dpc','排列三','全ngày一期','00:00:00',NULL,0,'pl3',1800,0,0,0,'00:00:00','00:00:00',1,0,37,137,0,0,0,1,5,0,30,30,1,NULL),(138,'pk10','幸运飞艇','全ngày180期','00:00:00',NULL,180,'xyft',30,0,0,0,'13:09:35','04:04:35',5,0,38,138,0,1,0,1,5,0,30,30,1,'qian1,qian2,qian3,qian4,qian5,dwd,'),(139,'keno','台湾宾果','全ngày204期',NULL,NULL,204,'twbg',30,0,0,0,'00:00:00','00:00:00',1,0,39,139,0,0,0,1,5,0,30,30,1,NULL),(140,'k3','10xu快3','10xu钟一期','00:00:00',NULL,143,'sfks',10,0,1,1,'00:00:00','23:59:00',10,0,40,140,0,1,1,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(141,'k3','极速快3','一xu钟一期','00:00:00','23:59:00',1439,'jisk3',10,0,0,1,'00:00:00','23:59:00',1,0,41,141,0,1,1,0,5,0,30,30,0,'sthtx,slhtx,k3hzzx,'),(142,'xy28','幸运28','全ngày179',NULL,NULL,179,'xy28',10,0,0,0,'00:00:00','00:00:00',1,0,42,142,0,0,0,1,5,0,30,30,1,'tm,hunhe,'),(145,'k3','幸运28','全ngày288期',NULL,NULL,288,'xyk3',10,0,0,1,'00:00:00','23:59:00',5,0,43,145,0,0,1,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(146,'k3','福彩3d','全ngày288期',NULL,NULL,288,'fck3',10,0,0,1,'00:00:00','23:59:00',5,0,44,146,0,0,1,1,5,0,30,30,1,'sthtx,slhtx,k3hzzx,'),(147,'xy28','xuxu28','1xu钟1期','00:00:00','23:59:59',1439,'yfxy28',10,1,0,1,'00:00:00','23:59:00',1,0,45,147,0,0,1,1,5,0,30,30,1,'tm,hunhe,'),(149,'ssc','腾讯xuxu彩','一xu钟一期','00:00:00','23:59:00',1439,'txssc',10,0,0,1,'00:00:00','23:59:00',1,0,0,148,0,0,0,0,6,0,30,30,1,'2x,dw,dxds,longhu,liangmian,qiansan'),(150,'xy28','南京28','','00:00:00','23:59:59',179,'nj28',10,1,1,1,'00:00:00','00:00:00',1,0,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL),(151,'xy28','山东28','','00:00:00','23:59:59',720,'sd28',10,1,1,1,'00:02:00','00:04:00',2,0,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL),(152,'dpc','福彩3D','','00:00:00','23:59:59',1,'fc3d',1800,0,0,0,'20:00:00','23:59:59',1440,1,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL),(153,'dwc','一xu动物彩','动物彩测试','00:00:00','23:59:59',1439,'yfdwc',10,1,0,0,'00:00:00','23:59:00',1,0,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL),(154,'dwc','三xu动物彩','动物彩测试','00:00:00','23:59:59',1439,'sfdwc',30,1,0,0,'00:00:00','23:59:00',3,0,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL),(155,'dwc','五xu动物彩','动物彩','00:00:00','23:59:59',288,'wfdwc',300,1,0,0,'00:00:00','23:59:00',5,0,0,999,0,0,0,0,NULL,NULL,NULL,NULL,NULL,NULL);
/*!40000 ALTER TABLE `caipiao_caipiao` ENABLE KEYS */;
UNLOCK TABLES;
